Acquiring state lock. This may take a few moments...
module.lambda_layer.data.archive_file.pymysql_layer: Reading...
module.lambda_layer.data.archive_file.pymysql_layer: Read complete after 0s [id=fdbcd5e1107f297ea43bc9c2c8cf137dabe8d5aa]
module.iam.aws_iam_policy.lambda_vpc_access_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_vpc_access_policy]
module.iam.aws_iam_role.eks_node_role: Refreshing state... [id=EKSNodeInstanceRole]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-054faa68dbb4bc84b]
module.iam.aws_iam_role.eks_cluster_role: Refreshing state... [id=EKSClusterRole]
module.lambda_layer.aws_lambda_layer_version.pymysql: Refreshing state... [id=arn:aws:lambda:ap-northeast-2:635140758252:layer:pymysql-layer:45]
module.iam.aws_iam_role.bastion_ssm_role: Refreshing state... [id=BastionSSMRole]
module.iam.aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_sql_initializer_role]
module.iam.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_sql_initializer_policy]
module.iam.aws_iam_role_policy_attachment.lambda_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250702031033390100000001]
module.iam.aws_iam_role_policy_attachment.lambda_vpc_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250702031033399100000002]
module.iam.aws_iam_role_policy_attachment.ssm_core: Refreshing state... [id=BastionSSMRole-20250702031033438100000005]
module.iam.aws_iam_instance_profile.bastion_ssm_profile: Refreshing state... [id=bastion-ssm-profile]
module.iam.aws_iam_role_policy_attachment.ec2_container_registry_read_only: Refreshing state... [id=EKSNodeInstanceRole-20250702031033434900000004]
module.iam.aws_iam_role_policy_attachment.eks_cni: Refreshing state... [id=EKSNodeInstanceRole-20250702031033402400000003]
module.iam.aws_iam_role_policy_attachment.eks_worker_node: Refreshing state... [id=EKSNodeInstanceRole-20250702031033443600000006]
module.iam.aws_iam_role_policy_attachment.eks_cluster_attach: Refreshing state... [id=EKSClusterRole-20250702031033486100000007]
module.subnet.aws_subnet.private_3b: Refreshing state... [id=subnet-05c79380193ae6595]
module.security_group.aws_security_group.lambda_sg: Refreshing state... [id=sg-09eaa327062bc1a56]
module.subnet.aws_subnet.private_4d: Refreshing state... [id=subnet-05363465369f56064]
module.subnet.aws_subnet.public_1a: Refreshing state... [id=subnet-0ad16645d934c7a00]
module.security_group.aws_security_group.bastion_sg: Refreshing state... [id=sg-0ba8e6d438aea8eac]
module.subnet.aws_subnet.public_2c: Refreshing state... [id=subnet-02cd6d0da113f8cb1]
module.security_group.aws_security_group.eks_sg: Refreshing state... [id=sg-057d36e940ad97467]
module.eks.aws_ecr_lifecycle_policy.spring_app: Refreshing state... [id=spring-app]
module.nat.aws_eip.nat_eip: Refreshing state... [id=eipalloc-0dea12799c7f4d7ba]
module.igw.aws_internet_gateway.this: Refreshing state... [id=igw-0acc8997fe1d712c8]
module.eks.aws_launch_template.eks_nodes: Refreshing state... [id=lt-00c1c6846b1b3172b]
module.security_group.aws_security_group.rds_sg: Refreshing state... [id=sg-0859d8c8042b5cc9b]
module.eks.aws_eks_cluster.this: Refreshing state... [id=news-cluster]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=news-rds]
module.rds.aws_db_parameter_group.timezone: Refreshing state... [id=news-rds-timezone]
module.bastion.aws_instance.bastion: Refreshing state... [id=i-0ce6fd4a1d24ef8fc]
module.nat.aws_nat_gateway.nat: Refreshing state... [id=nat-0e0682f9536b2eeb0]
module.route.aws_route_table.public: Refreshing state... [id=rtb-0adb1fc63db133c74]
module.route.aws_route_table.private: Refreshing state... [id=rtb-01817ebd154fa218e]
module.route.aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-0de750020ea02dcf7]
module.route.aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-0be7375455066d82a]
module.route.aws_route.private_route: Refreshing state... [id=r-rtb-01817ebd154fa218e1080289494]
module.route.aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-054646ea49a0427ac]
module.route.aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-0cdc064acd4c63d04]
module.route.aws_route.public_route: Refreshing state... [id=r-rtb-0adb1fc63db133c741080289494]
module.eks.aws_eks_node_group.default: Refreshing state... [id=news-cluster:news-cluster-ng]
module.eks.aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::635140758252:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/C6F93228AE6C670C70A3337A5D00DC8A]
module.rds.aws_db_instance.this: Refreshing state... [id=db-2JPXEVLFF7X4XW5OGUNTO6U7EM]
module.docker_images.aws_lambda_function.news-crawler_mw: Refreshing state... [id=news-crawler-lambda]
module.sending_news.aws_lambda_function.this: Refreshing state... [id=news-lambda-handler]
module.sql_initializer.aws_lambda_function.sql_initializer: Refreshing state... [id=rds-sql-initializer]
module.eventbridge_scheduler.aws_cloudwatch_event_rule.schedule["crawler"]: Refreshing state... [id=crawler]
module.eventbridge_scheduler.aws_cloudwatch_event_rule.schedule["sending_news"]: Refreshing state... [id=sending_news]
module.eventbridge_scheduler.aws_lambda_permission.allow_eventbridge["sending_news"]: Refreshing state... [id=AllowExecutionFromEventBridge-sending_news]
module.eventbridge_scheduler.aws_lambda_permission.allow_eventbridge["crawler"]: Refreshing state... [id=AllowExecutionFromEventBridge-crawler]
module.eventbridge_scheduler.aws_cloudwatch_event_target.lambda["sending_news"]: Refreshing state... [id=sending_news-sending-news]
module.eventbridge_scheduler.aws_cloudwatch_event_target.lambda["crawler"]: Refreshing state... [id=crawler-crawler]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.aws_eks_node_group.default is tainted, so must be replaced
-/+ resource "aws_eks_node_group" "default" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:ap-northeast-2:635140758252:nodegroup/news-cluster/news-cluster-ng/2ccbe4e8-f232-f893-bffc-b8a296c835ca" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "news-cluster:news-cluster-ng" -> (known after apply)
      ~ instance_types         = [
          + "t3.medium",
        ]
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.33.0-20250627" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-news-cluster-ng-2ccbe4e8-f232-f893-bffc-b8a296c835ca"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Name" = "news-cluster-ng"
        }
      ~ version                = "1.33" -> (known after apply)
        # (6 unchanged attributes hidden)

      - launch_template {
          - id      = "lt-00c1c6846b1b3172b" -> null
          - name    = "eks-node-20250702061943839000000001" -> null
          - version = "1" -> null
        }

      ~ node_repair_config (known after apply)

      + remote_access {
          + ec2_ssh_key = "my-kp"
        }

      ~ update_config (known after apply)
      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }

        # (1 unchanged block hidden)
    }

  # module.eks.aws_launch_template.eks_nodes will be destroyed
  # (because aws_launch_template.eks_nodes is not in configuration)
  - resource "aws_launch_template" "eks_nodes" {
      - arn                                  = "arn:aws:ec2:ap-northeast-2:635140758252:launch-template/lt-00c1c6846b1b3172b" -> null
      - default_version                      = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - id                                   = "lt-00c1c6846b1b3172b" -> null
      - instance_type                        = "t3.medium" -> null
      - key_name                             = "my-kp" -> null
      - latest_version                       = 1 -> null
      - name                                 = "eks-node-20250702061943839000000001" -> null
      - name_prefix                          = "eks-node-" -> null
      - region                               = "ap-northeast-2" -> null
      - security_group_names                 = [] -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null
      - vpc_security_group_ids               = [] -> null
        # (7 unchanged attributes hidden)

      - network_interfaces {
          - associate_public_ip_address  = "false" -> null
          - device_index                 = 0 -> null
          - ipv4_address_count           = 0 -> null
          - ipv4_addresses               = [] -> null
          - ipv4_prefix_count            = 0 -> null
          - ipv4_prefixes                = [] -> null
          - ipv6_address_count           = 0 -> null
          - ipv6_addresses               = [] -> null
          - ipv6_prefix_count            = 0 -> null
          - ipv6_prefixes                = [] -> null
          - network_card_index           = 0 -> null
          - security_groups              = [
              - "sg-057d36e940ad97467",
            ] -> null
            # (8 unchanged attributes hidden)
        }

      - tag_specifications {
          - resource_type = "instance" -> null
          - tags          = {
              - "Name" = "news-cluster-node"
            } -> null
        }
    }

  # module.security_group.aws_security_group.eks_sg will be updated in-place
  ~ resource "aws_security_group" "eks_sg" {
        id                     = "sg-057d36e940ad97467"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0ffc47b75ec467f5a",
                ]
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
            # (2 unchanged elements hidden)
        ]
        name                   = "eks-sg"
        tags                   = {
            "Name" = "eks-sg"
        }
        # (9 unchanged attributes hidden)
    }

  # module.sending_news.data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/sending_news/lambda_function.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "../../modules/lambda/sending_news/lambda_function.py"
      + type                = "zip"
    }

  # module.sending_news.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "news-lambda-handler"
      ~ last_modified                  = "2025-07-02T03:34:29.307+0000" -> (known after apply)
      ~ source_code_hash               = "FtRrR/ClrxzO8Yl5FoIeJxYT0ewxtN466OGJeGx+hzk=" -> (known after apply)
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sql_initializer.data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/sql_initializer/sql_init.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../modules/lambda/sql_initializer"
      + type                = "zip"
    }

  # module.sql_initializer.aws_lambda_function.sql_initializer will be updated in-place
  ~ resource "aws_lambda_function" "sql_initializer" {
        id                             = "rds-sql-initializer"
      ~ last_modified                  = "2025-07-02T03:36:32.954+0000" -> (known after apply)
      ~ source_code_hash               = "/xVmCNeJ7b7FXVnrIZDUxU9FRpT8KdKuQCE7chb4AJ8=" -> (known after apply)
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 2 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "db_password" but a value
was found in file "terraform.auto.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

<!-- Sticky Pull Request Comment -->